var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "王浩然",
    sex: "男",
    age: "20",
    phone: "15123813662",
    email: "20192519@cqu.edu.cn",
    address: "现居重庆市重庆大学虎溪校区",
    qq: "609190761",
    log: "Ming_coder",
    excpect_work: "js前端开发",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "颓废的成因是:做过于轻松的事情,过于懒惰而无法做好事情,欣赏太多艺术,喜好怪诞异常的东西。",
        "对所有事物朴素地追求美和真实。"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome:  ["你好，我是王浩然，重庆大学自动化学院大三在读<br>" +
             "很高兴见到你!",],


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about:[ "掌握JavaScript HTML CSS开发，熟悉主流js框架如vue，熟悉嵌入式开发，计算机硬件基础，自动控制"],


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
       
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        // ]
    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        
    ],


    /**
     * 在这里填写您的社交网络平台
     * ["img", "url", "desc"]
     * img是社交平台的图标，在./svg目录下我们已经准备好了 微博、简书、掘金、小红书、知乎、csdn、facebook、github、力扣、CF和qq的图标
     * url是您链接
     * desc是一段描述，将鼠标移入将会显示该描述
     * 建议您放置数量 <= 5
     */
    icon: [
        
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/2.jpg",
        "./images/work-bk.png",  //jpg png混着用，真下头
        "./images/4.jpg"
    ]

}